Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInDesignOption Property
 A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingPadByElementsInDesignOption { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingPadByElementsInDesignOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingPadByElementsInDesignOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace